 {
    "STATION_SETUP": {"en": "Station settings", "ru": "Настройки станции"},
    "CLEAR_ALL": {"en": "Clear station settings", "ru": "Очистить настройки станции"},
    "HOW_TO_TRACK_BTN": {"en": "How to upload track?", "ru": "Как загрузить маршрут?"},
    "CHANGE_EMAIL": {"en": "Change email/password", "ru": "Сменить email/пароль"},
    "POPUP_STATION": {"ru": "Поставьте отметку для публикации вашей экспедиции в списке станций на главной странице. <br/>Отметку ставьте после того, как ваш профиль по станции полностью готов.<br/><u>Ссылку на страницу станции</u> удобно использовать для распространения в соц.сетях/форумах/кластерах.", "en": "Check the box to post your station on the front page. <br/> Check only if you have finished the profile editing.<br/><u>Station page link</u> is convinient for posting in social media/forums/dx clusters."},
    "STATION_CALLSIGN": {"en": "Expedition's callsign", "ru": "Позывной экспедиции"},
    "STATION_LINK": {"en": "Your link", "ru": "Ваша ссылка"},
    "STATION_TITLE": {"en": "Expedition's title", "ru": "Название экспедиции"},
    "STATION_PERIOD": {"en": "Activity period", "ru": "Период активности"},
    "STATION_SHOW": {"en": "Show", "ru": "Показывать"},
    "STATION_NOT_SHOW": {"en": "Do not show", "ru": "Не показывать"},
    "STATION_THIS": {"en": "this station", "ru": "эту станцию"},
    "STATION": {"en": "station", "ru": "станцию"},
    "STATION_VIEW": {"en": "on the TNXQSO.com main page", "ru": "на главной странице TNXQSO.com"},
    "STATUS_TAB": {"en": "Tab <b>STATUS</b> on the station's page", "ru": "Вкладка <b>СТАТУС</b> на странице станции"},
    "STATUS_FROM": {"en": "Take ONLINE/OFFLINE status from", "ru": "ONLINE/OFFLINE статус и QTH данные"},
    "STATUS_MANUAL": {"en": "Specify manually", "ru": "Указать вручную"},
    "MANUAL": {"en": "Manual", "ru": "Ручное управление"},
    "EDIT_CURRENT": {"en": "Edit current", "ru": "Редактирование текущего"},
    "STATUS_VIEW": {"en": "Show on this tab", "ru": "Показывать на этой вкладке"},
    "POPUP_STATUS": {"ru": "Выберите, откуда будет поступать информация о том, что станция ONLINE или OFFLINE.<br/><img src=\"/static/images/oo_tab.jpg\"><br/><br/><b>TNXLOG / QTHnow</b><br/>Если на компьютере экспедиции запущен настроенный TNXLOG или на телефоне запущена QTH now, то статус - ONLINE.<br/>Данные об RDA, RAFA и т.д. задаются в программе TNXlog (вручную или автоматически).<br/><br/><b>При ручном указании</b> статуса ONLINE/OFFLNE все поля заполняются здесь, в Профиле станции.<br/>Можно выбирать данные, которые будут транслироваться на этой вкладке.<br/><br/><i>Не забудьте нажать на кнопку Save all info.</i>", "en": "Choose where the information that the station is ONLINE or OFFLINE will come from.<br/><img src=\"/static/images/oo_tab.jpg\"><br/><br/><b>TNXLOG/QTHnow</b><br/>If the configured TNXLOG is running on the expedition computer or QTH now is running on the phone, the status is ONLINE. <br/> RDA, RAFA data, etc are set in the TNXlog program (manually or automatically).<br/><br/><b>When marked MANUALLY</b> the ONLINE/OFFLNE status, all fields are filled here in the Station's Profile. <br/> You can select data that will be broadcast to this tab.<br/><br/><i>Do not foget to click on the \"Save all info\" button.</i>"},
    "MAP_SHOW": {"en": "Show <b>Map</b> tab on your station page", "ru": "Показывать вкладку <b>Map</b> на странице вашей станции"},
    "MAP_ICON": {"en": "Icon to display your station on the map", "ru": "Иконка для отображения вашей станции на карте"},
    "MAP_FILE": {"en": "File uploaded", "ru": "Загружен файл"},
    "MAP_UPLOAD": {"en": "Upload KML/KMZ/GPX file with expedition's route", "ru": "Загрузка KML/KMZ/GPX файла с маршрутом экспедиции"},
    "MAP_CLEAR": {"en": "Delete file", "ru": "Удалить файл"},
    "LOG_SHOW": {"en": "Show <b>Log</b> tab on your station page", "ru": "Показывать вкладку <b>Log</b> на странице вашей станции"},
    "LOG_POPUP": {"en": "Mark those log columns that will be broadcast to the website.", "ru": "Отметьте те колонки лога, которые будут транслироваться на сайт"},
    "LOG_COLUMNS": {"en": "Show columns in the log", "ru": "Показывать в логе колонки"},
    "LOG_CLEAR": {"en": "Clear online log", "ru": "Очистить онлайн-лог"},
    "LOG_DOWNLOAD": {"en": "Download online log", "ru": "Скачать онлайн-лог"},
    "INFO_SHOW": {"en": "Show <b>Info</b> tab on your station page", "ru": "Показывать вкладку <b>Info</b> на странице вашей станции"},
    "INFO_POPUP": {"en": "In the <b>INFO</b> tab, it is appropriate to place general information and a photo with a description of the purpose, the composition of the operators, the route of the expedition/station.", "ru": "Во вкладке <b>INFO</b> уместно разместить общую информацию и фото с описанием цели, состава операторов, маршрута экспедиции/станции."},
    "CLUSTER_SHOW": {"en": "Show <b>Cluster</b> tab on your station page", "ru": "Показывать вкладку <b>Cluster</b> на странице вашей станции"},
    "CLUSTER_POPUP": {"en": "You can write either a specific callsign (R7AB or R7AB/M) or a group of callsigns using this mark <b>*</b><br/> <b> */P</b> - all .../P callsigns all over the world will be displayed. <br/> It is better to highlight with color only the callsign of your expedition / station.", "ru": "Указывать можно как конкретный позывной (R7AB или R7AB/M), так и группу позывных, используя &laquo;звездочку&raquo;.<br/><b>*/P</b> - будут показываться все .../P позывные в мире.<br/><b>R* UA* UB* UC* UD* UE* UF* UG* UH* UI*</b> - будут показываться все российские позывные.<br/><b>R*/* UA*/* UB*/* UC*/* UD*/* UE*/* UF*/* UG*/* UH*/* UI*/*</b> - будут показываться все российские позывные c дробью.<br/>Выделять цветом лучше только позывной своей экспедиции/станции."},
    "CLUSTER_FILTER": {"en": "Call signs or filters for tracking <i> (separated by space or comma) </i>", "ru": "Позывные или фильтры для отслеживания <i>(разделяются пробелом или запятой)</i>"},
    "CLUSTER_CALL": {"en": "Call signs for highlighting <i> (separated by space or comma) (visible only by the station administrator)</i>", "ru": "Позывные для выделения цветом <i>(разделяются пробелом или запятой) (видит только администратор станции)</i>"},
    "CHAT_SHOW": {"en": "Show <b>Chat</b> tab on your station page", "ru": "Показывать вкладку <b>Chat</b> на странице вашей станции"},
    "CHAT_POPUP": {"en": "Only a station's administrator can delete chat messages.", "ru": "Удалять сообщения чата может только администратор станции."},
    "CHAT_HIGHLIGHT": {"en": "Call signs for highlighting <i> (separated by space or comma)</i>", "ru": "Позывные для выделения цветом <i>(разделяются пробелом или запятой)</i>"},
    "CHAT_ADMINS": {"en": "Chat admins <i>(separated by space or comma)</i>", "ru": "Администраторы чата <i>(разделяются пробелом или запятой)</i>"},
    "CHAT_ACCESS_RESTRICTED": {"en": "Only station admins can post messages in this chat.",
        "ru": "В этот чат могут писать только администраторы станции."},
    "CHAT_BANNED": {"en": "Your account is read-only in this chat.",
        "ru": "Ваш аккаунт в режиме read-only в это чате."},
    "CHAT_ACCESS_EVERYBODY": {"en": "Everybody", "ru": "Все"},
    "CHAT_ACCESS_CHANGE": {"en": "will be able to post messages.", "ru": "смогут отправлять сообщения."},
    "CHAT_ACCESS_USERS": {"en": "All registered users", "ru": "Все пользователи"},
    "CHAT_ACCESS_ADMINS": {"en": "Only station administrators", "ru": "Только администраторы станции"},
    "CHAT_ACCESS_SWITCH": {"en": "Switch to this chat mode?", "ru": "Переключиться в этот режим чата?"},
    "CHAT_CHECK": {"en": "Do not request confirmation for deleting messages", "ru": "Не требовать подтверждения при удалении сообщений"},
    "CHAT_CLEAR": {"en": "Clear chat", "ru": "Очистить чат"},
    "BLACKLIST_REMOVE": {"en": "Remove from BLACKLIST", "ru": "Удалить из BLACKLISTа"},
    "STATS_SHOW": {"en": "Show <b>Stats</b> tab on your station page", "ru": "Показывать вкладку <b>Stats</b> на странице вашей станции"},
    "STATS_POPUP": {"en": "This tab will display real-time QSO statistics.", "ru": "На этой вкладке будет отображаться статистика связей в реальном времени."},
    "BLOG_SHOW": {"en": "Show <b>Blog</b> tab on your station page", "ru": "Показывать вкладку <b>Blog</b> на странице вашей станции"},
    "BLOG_POPUP": {"en": "This tab will display photos that you can upload either from your phone using the TNXpost Android-program <br/> or in the upload form directly in the Blog tab of your station's page.", "ru": "На этой вкладке будет отображаться фото, которые вы можете загрузить либо с телефона программой TNXpost,<br/>либо в форме загрузки непосредственно во вкладке Blog страниц вашей станции."},
    "BLOG_CHECK": {"en": "Do not request confirmation for deleting photos/videos", "ru": "Не требовать подтверждения при удалении фото/видео"},
    "BLOG_CLEAR": {"en": "Clear Blog", "ru": "Очистить Blog"},
    "DONATE_SHOW": {"en": "Show <b>Donate</b> tab on your station page", "ru": "Показывать вкладку <b>Donate</b> на странице вашей станции"},
    "DONATE_CODE": {"en": "Code from payment system", "ru": "Код из платежной системы"},
    "ABOUT": {"ru": "<p>Сайт TNXQSO.com сделан для организации информационного сопровождения радиолюбительских экспедиций и специальных станций.  Регистрация на сайте нужна только для управления информационными службами сопровождения своей радиоэкспедиции/станции. Пользование всеми службами сайта бесплатно.</p><br/><br/><h4>Для работы необходимо</h4><p><img src=\"/static/images/about_log.jpg\" class=\"intext\"><br/>Программа для смартфона на Андроиде <a href=\"/tnxlog\"><b>QTH now</b></a> отправляет ваши текущие координаты на сервер TNXQSO.com<br/>В программе для компьютера <a href=\"/tnxlog\"><b>TNXLOG</b></a> ведётся лог станции.<br/>Из этой программы данные QSO отправляются на сервер TNXQSO.com на вкладку Онлайн-лог.</p><br/><br/><br/><h4>Пример настроек Профиля экспедиции/станции</h4><p><br/><img src=\"/static/images/example.jpg\" class=\"intext\"><br/></p>", "en": "<p>TNXQSO.com is created for the information support of DXpeditions and special stations.<br/>You don't need to create account unless you want to use this website for your DXpedition/station.<br/><br/><u>The site usage is completely free</u>.</p><br/><h4>To work with our site you will need</h4><p><img src=\"/static/images/about_log.jpg\" class=\"intext\"><br/>Android app <a href=\"/tnxlog\"><b>QTH now</b></a> sends your current position to TNXQSO.com<br/><a href=\"/tnxlog\"><b>TNXLOG</b></a> (Windows or Android) is the logger with  sending QSO data to the server for the online-log (Log tab).</p><br/><br/><br/><h4>The examle of DXpedition/station's profile setup</h4><p><br/><img src=\"/static/images/example.jpg\" class=\"intext\"><br/></p>"},
    "QTHNOW": {"ru": "<p>Программа по вашим текущим координатам определяет текущий RDA, локатор и RAFA.<br/>Если вы находитесь на расстоянии 250 метров до границы двух районов, то программа покажет оба. Первым показывается район точно по координатам. За ним - районы, которые находятся рядом (~250 метров).</p><p>Обновление информации - каждые 10 секунд. Для работы программы обязателен доступ к Интернету.<br/>Фонового режима работы программы нет. Т.е. для отправки координат программа должна быть запущена и показываться на экране смартфона. Координаты будут отправляться независимо от того, на каком экране (данные, карта, чат) находится пользователь.</p><p>Если в настройках программы вы укажете свой логин/пароль доступа к TNXQSO.com:<br/>- полученные от вас координаты будут отображаться на вкладке MAP на странице вашей экспедиции/станции на TNXQSO.com<br/>- в разделе Чат у вас будет возможность видеть и отправлять сообщения не только в Talks, но и в Chat своей станции.</p><p>В программе есть возможность делать снимки экрана, которые сохраняются в Галерее телефона <i>(Pictures/Screenshots)</i>.</p><p>Приложение использует данные <a href=\"https://r1cf.ru/rdaloc/\" target=\"_blank\">картографического сервиса R1CF</a>, за что ему Большое спасибо.</p>", "en": "<p>The program was developed for radioamateurs who participate in the RDA and RAFA diploma program.<br/>The program sends your current coordinates to the TNXQSO.com server and receives your current RDA, locator and RAFA in response. Information update - every 10 seconds.</p><p>But for radio amateurs outside the borders of Russia, this program will be useful as an information service for the operation of your station/expedition. If you register on TNXQSO.com as a station administrator, enter your login/password in the program Settings. Then you will have this:<br/>- The coordinates received from you will be displayed on the MAP tab on the page of your expedition / station.<br/>- The ability to see and send chat messages on TNXQSO.com directly from QTH now.</p><p><u>There is no background mode of the program</u>. To send coordinates the program must be launched and displayed on the smartphone's screen. Coordinates will be sent regardless of what screen (Data, Map, Spot, Chat) the user is on.</p>"},
    "TNXPOST": {"ru": "<h3>TNXpost</h3><img src=\"/static/images/web_tnxpost_01.png\"> &nbsp; &nbsp; &nbsp; <img src=\"/static/images/web_tnxpost_02.png\"><br/></br><p>Программа для загрузки выбранных фото/видео файлов в вашу Blog на TNXQSO.com.</p><p>Программа позволяет только загружать файлы на сервер. Удалять файлы может только администратор станции непосредственно на вкладке Blog. Можно также добавить небольшое описание к файлу.</p></br><a href=\"https://play.google.com/store/apps/details?id=com.tnxqso.tnxpost\" target=\"_blank\"><img src=\"/static/images/ru_badge_web_generic.png\" width=\"200\" class=\"intext\"></a><br/><br/><br/>", "en": "<h3>TNXpost</h3><img src=\"/static/images/web_tnxpost_01.png\"> &nbsp; &nbsp; &nbsp; <img src=\"/static/images/web_tnxpost_02.png\"><br/></br><p>The program for uploading selected photo/video files to your Blog tab on TNXQSO.com.</p><p>The program only allows you to upload files to the server. Only the station administrator can delete files on the Blog tab.</p><p>You can also add a small description to the file.</p></br><a href=\"https://play.google.com/store/apps/details?id=com.tnxqso.tnxpost\" target=\"_blank\"><img src=\"/static/images/ru_badge_web_generic.png\" width=\"200\" class=\"intext\"></a><br/><br/><br/>"},
    "TNXINFO": {"ru": "<h3>TNXinfo</h3><img src=\"/static/images/web_tnxinfo1.jpg\"> &nbsp; &nbsp; &nbsp; <img src=\"/static/images/web_tnxinfo2.jpg\"><br/></br><p>Программа сделана, чтобы вы не бегали каждые 5 минут к компьютеру для слежения за какой-либо активной станцией на TNXQSO.com. В программе показывается список активных станций с индикацией рабочей частоты, QTH данных и статуса ONLINE/OFFLINE станции.<br/>Кликом по иконке чата можно просмотреть чат станции. Отправления сообщений в чат нет.<br/>Долгий клик по карточке станции включает/выключает уведомления. Уведомление появляется при смене станцией частоты или при смене РДА. Уведомление происходит звуком и текстом в строке состояния телефона. Уведомление-текст само удаляется через 30 секунд.<br/>Автообновление данных в программе происходит каждые 30 секунд.<br/>В программе можно просмотреть общий чат TNXQSO.com - Talks. Автообновления Talks (как и персонального чатов станции) нет. Обновить сообщения можно свайпом сверху вниз.<br/>В программе есть <u>виджет</u>. Он устанавливается на домашний экран телефона так же, как и любой другой виждет телефона. Виджет отслеживает одну станцию. Клик на позывному на виджете вызывает окно выбора позывного станции для отслеживания. Клик по остальному полю виджета обновляет данные на виджете. Автоматического обновления виджета нет.<br/>Клик по иконке ( i ) в приложении покажет краткую инструкцию.</p></br><a href=\"https://play.google.com/store/apps/details?id=com.tnxqso.tnxinfo\" target=\"_blank\"><img src=\"/static/images/ru_badge_web_generic.png\" width=\"200\" class=\"intext\"></a><br/><br/><br/>", "en": "<h3>TNXinfo</h3><img src=\"/static/images/web_tnxinfo1.jpg\"> &nbsp; &nbsp; &nbsp; <img src=\"/static/images/web_tnxinfo2.jpg\"><br/></br><p>The program is made so that you do not run every 5 minutes to the computer to monitor any active station on TNXQSO.com. The program shows a list of active stations with an indication of the operating frequency, QTH data and ONLINE / OFFLINE status of the station.<br/>By clicking on the chat icon, you can view the chat of the station. There is no sending messages to the chat.<br/>A long click on the station card turns notifications on/off. The notification appears when the station changes the frequency or when the RDA changes. Notification occurs by sound and text in the status bar of the phone. Notification-text itself is deleted after 30 seconds.<br/>Auto-update of data in the program occurs every 30 seconds.<br/>In the program you can view the common chat TNXQSO.com - Talks. There is no auto-updating of Talks (as well as personal chats of the station). You can update messages by swiping from top to bottom.<br/>The program has a widget. It may be installed on the phone's home screen just like any other phone widget. The widget tracks one station. Clicking on a callsign on the widget brings up a window for selecting the station's callsign to track. Clicking on the rest of the widget field updates the data on the widget. There is no automatic update of the widget.<br/>Clicking on the icon ( i ) in the application will show a brief instruction.</p></br><a href=\"https://play.google.com/store/apps/details?id=com.tnxqso.tnxinfo\" target=\"_blank\"><img src=\"/static/images/ru_badge_web_generic.png\" width=\"200\" class=\"intext\"></a><br/><br/><br/>"},
    "TNXLOG": {"ru": "<h3>TNXLOG</h3><p><b>Программа-логгер</b>:<br/>- отправляет текущие QSO на сервер TNXQSO.com.<br/>- получает c сервера TNXQSO.com ваш текущий RDA, Locator и RAFA.<br/>- ведет статистику QSO в реальном ремени.<br/>- экспорт ADIF c разбиением общего лога в отдельные файлы по позывным (../M ../P) Активатора и по RDA.<br/>- работа CW-макросами по COM-порту.<br/></p><table><tr><td><img src=\"/static/images/tnxlog_web_01.png\"><br/></td><td><b>1</b> - Ввод позывного корреспондента.<br/><br/><b>2</b> - Автоматическое <i>(c сайта TNXQSO.com)</i> или ручное указание RDA, RAFA, локатора. В поле User field можно указать любую другую информацию по QTH, например, RFF.<br/><br/><b>3</b> - Статистика текущего лога. При отметке auto район, mode, band будут меняться автоматически.<br/><br/><b>4</b> - Подсказка позывного по текущему логу.<br/><br/><b>5</b> - Подсказка, по заданным в Настройках, CW-макросам.<br/><br/><b>6</b> - Скорость передачи CW-макросов.<br/><br/><b>7</b> - Подсказка позывного по общей базе позывных.<br/><br/><b>8</b> - Отправка частоты на TNXQSO.com во вкладку СТАТУС и в чат станции<br/><br/><b>9</b> - Окно TNXLOG будет показываться поверх остальных открытых окон.<br/><br/></td></tr></table><p><b><u>\"Горячие клавиши\" программы</u></b><br/><b>Ctrl-W</b>, <b>Alt-W</b> или <b>~</b> - Очистка поля ввода позывного.<br/><b>Ctrl-K</b>, <b>Alt-K</b> - Ввод свободного текста в CW. Выход - Esc.<br/><b>Ctrl-Q</b> - Возвращает из лога последний введённый позывной. В самом логе это QSO удаляется. Позывной снова вставляется в CW-макросы. Для внесения позывного в лог надо снова будет нажать Enter.<br/><b>Ctrl-M</b> - Режим ESM (<i>Enter Send Message</i>). По нажатию Enter позывной заносится в лог и передаётся CW-макрос, заданный в Настройках. Работает только в CW.</p><p><u><b>В CW-макросах автоматически вставляются</b></u>:<br/><b>{MY_CALL}</b> - ваш позывной.<br/><b>{CALL}</b> - позывной корреспондента.<br/><b>{RDA}</b>, <b>{RAFA}</b>, <b>{LOCATOR}</b>, <b>{USER_FIELD}</b> - данные из соответствующих полей.</p><p>CW-макросы \"помнят\" последний переданный позывной корреспондента, если поле ввода позывного пустое.</p><p><u><b>Аудио запись QSO</b></u>:<br/>После нажатия кнопки START с выбранного в Настройках аудио входа идёт запись MP3 файлов длительностью в 1 минуту. Занесение в лог позывного (нажатие ENTER) за эту минуту подразумевает, что QSO с этим позывным есть в этом файле.<br/>После создания файла программа сразу отправляет его на сервер TNXQSO.com<br/>Если файл успешно отправлен, он удаляется из памяти компьютера. Если нет, то ждёт успешной отправки.<br/>Приоритет отправки - сначала QSO, затем аудиофайлы.</p><br/><br/><p style=\"text-align: center; font-size: 24px;\"><a href=\"/static/files/tnxlog.msi\"><b>Скачать TNXLOG</b></a></p><br/><br/><br/><hr/><br/><br/><br/><h3>TNXLOG для Android смартфона/планшета</h3><p>Со встроенным функционалом QTHnow и отправкой связей на TNXQSO.com</p><table><tr><td><img src=\"/static/images/tnxlog_android_web_01.png\"><br/></td><td><b>1</b> - Указать свой позывной.<br/><br/><b>2</b> - Указать MODE.<br/><br/><b>3</b> - Указать диапазон.<br/><br/><b>4</b> - Указать частоту в кГц <i>(например, 14000.1)</i>.<br/><br/><b>5</b> - Кнопка отправки частоты в ЧАТ станции и вкладку СТАТУС.<br/><br/><b>6</b> - Поиск по логу.<br/><br/><b>7</b> - Долгое нажатие по QSO с логе вызывает<br/>форму редактирования/удления QSO<br/><br/></td></tr></table><p>Программа отправляет текущую связь на вкладку Log вашей станции на сервере. Нажатие на стрелку возле частоты отправляет установленную частоту в чат вашей станции и вкладку \"Статус\".</p><p>Программа отправляет координаты на сервер. По этим координатам устанавливается отметка вашего местоположения на карте во вкладке Map.  Также в ответ приходит текущий RDA, RAFA и локатор. Эти данные могут автоматически записываться в журнал с каждым QSO.</p><p>Встроенный чат от TNXQSO. Если указать логин/пароль к серверу, то можно будет общаться в персональном чате станции.</p><p>Ведётся статистика лога с разделением по диапазонам и модам.</p><p>Если в разделе Log нажать на позывной станции, появляется окно для редактирования или удаления QSO.</p><p>Лог можно экспортировать в стандартный ADIF и сохранить в памяти телефона.</p></br><a href=\"https://play.google.com/store/apps/details?id=com.tnxqso.tnxlog\" target=\"_blank\"><img src=\"/static/images/ru_badge_web_generic.png\" width=\"200\" class=\"intext\"></a><br/><br/><br/>", "en": "<h3>TNXLOG</h3><p><b>Logging software</b>:<br/>- sends current QSOs to TNXQSO.com server.<br/>- receives from your TNXQSO.com server your current RDA, Locator, and RAFA.<br/>- keeps real-time QSO statistics.<br/>- ADIF export with splitting the general log into separate files by callsign (../M ../P).<br/>- support for working with CW macros by the COM port.<br/></p><table><tr><td><img src=\"/static/images/tnxlog_web_01.png\"><br/></td><td><b>1</b> - Window for correspondent's callsign.<br/><br/><b>2</b> - Automatic <i>(from TNXQSO.com)</i> or manual indication of RDA, RAFA, locator. In the User field you can specify any other information about QTH, for example, WWFF or WCA.<br/><br/><b>3</b> - Statistics of the current log. When marking <i>auto</i> region, mode, band will change automatically.<br/><br/><b>4</b> - Callsign's hint for the current log.<br/><br/><b>5</b> - Hint about the CW macros specified in Settings..<br/><br/><b>6</b> - CW macros's speed.<br/><br/><b>7</b> - Callsign's hint for the general base of callsigns.<br/><br/><b>8</b> - Sending frequency to TNXQSO.com in the STATUS tab and station's chat<br/><br/><b>9</b> - TNXLOG window will be displayed on top of other opened windows.<br/><br/></td></tr></table><p><b><u>\"Hotkeys\" of the program</u></b><br/><b>Ctrl-W</b>, <b>Alt-W</b> or <b>~</b> - Clear the callsign input field.<br/><b>Ctrl-K</b>, <b>Alt-K</b> - Transmit free text in CW. Exit - Esc.<br/><b>Ctrl-Q</b> - Returns the last callsign entered to the log. In the log this QSO is deleted. The callsign is reinserted into the CW macros. To enter the callsign in the log you will need to press Enter again. <br/><b>Ctrl-M</b> - ESM mode (<i>Enter Send Message</i>). By pressing Enter the callsign is logged and the CW macro specified in Settings is transmitted. Only works in CW.</p><p><u><b>In CW macros they are automatically inserted</b></u>: <br/><b>{MY_CALL}</b> is your callsign.<br/><b>{CALL}</b> - the callsign of your correspondent.<br/><b>{RDA}</b>, <b>{RAFA}</b>, <b>{LOCATOR}</b>, <b>{USER_FIELD}</b> - data from the corresponding fields.</p><p>CW macros \"remember \" the last transmitted correspondent's callsign, if the callsign input field is empty.</p><p><u><b>Audio recording QSO</b></u>:<br/>After pressing the START button from the audio input selected in the Settings MP3 files are recorded with a duration of 1 minute. Logging a callsign (pressing ENTER) for this minute means that there is a QSO with this callsign in this file.<br/>After the file is created the program immediately sends it to the TNXQSO.com server<br/>If the file is successfully sent it is deleted from computer memory. If not it waits for a successful sending.<br/>Sending priority is QSOs first, then audio files.</p><br/><br/><p style=\"text-align: center; font-size: 24px;\"><a href=\"/static/files/tnxlog.msi\"><b>Download TNXLOG</b></a></p><br/><br/><br/><hr/><br/><br/><br/><h3>TNXLOG for Android smartphone/tablet</h3><p>With built-in QTHnow functionality and sending QSO to TNXQSO.com</p><table><tr><td><img src=\"/static/images/tnxlog_android_web_01.png\"><br/></td><td><b>1</b> - Enter your callsign.<br/><br/><b>2</b> - Enter BAND.<br/><br/><b>3</b> - Enter MODE.<br/><br/><b>4</b> - Enter frequency in kHz <i>(for example, 14000.1)</i>.<br/><br/><b>5</b> - The button for sending frequency to the station's CHAT and to the STATUS tab.<br/><br/><b>6</b> - Log Search.<br/><br/><b>7</b> - A long press on the QSO with the log causes <br/> the QSO edit/delete form<br/><br/></td></tr></table><p>The program sends the current QSO to the Log tab of your station on the server. Clicking on the arrow near the frequency sends the frequency to your station’s chat and the \"Status \" tab.</p><p>The program sends the coordinates to the server. These coordinates are used to mark your location on the map in the Map tab. Also in response comes the current RDA, RAFA and locator. This data can be automatically logged with each QSO.</p><p>Built-in chat from TNXQSO. If you specify the username/password for the server, you can communicate in your personal station's chat .</p><p>Log statistics are maintained with the division by bands and modes.</p><p>If you click on the call sign in the Log section, a window appears for editing or deleting the QSO.</p><p>The log can be exported to standard ADIF and saved in the phone’s memory.</p></br><a href=\"https://play.google.com/store/apps/details?id=com.tnxqso.tnxlog\" target=\"_blank\"><img src=\"/static/images/ru_badge_web_generic.png\" width=\"200\" class=\"intext\"></a><br/><br/><br/>"},
    "CONFIRM_EMAIL_WARNING": {"ru": "<b>Ваш email адрес не подтверждён.</b><br/><span>Мы отправили вам письмо с подтверждающей ссылкой. Нажмите на неё и затем обновите эту страницу.<br/>Если письмо долго не приходи, поищите его папке Спам или отправьте его ещё раз.</span><br/>", "en": "<b>Your email address is not confirmed.</b><br/><span>We sent you an email verification link. Follow the link in the message then refresh this page.<br/>If you don't see it in your inbox, please check your spam folder or resend the email.</span><br/>"},
    "CONFIRM_EMAIL_BUTTON": {"ru": "Отправить письмо ещё раз", "en": "Resend the email"},
    "PERSONAL_MESSAGES_ON": {"ru": "Персональные сообщения включены", "en": "Personal messages are ON"},
    "PERSONAL_MESSAGES_OFF": {"ru": "Персональные сообщения выключены", "en": "Personal messages are OFF"},
    "PERSONAL_MESSAGE": {"ru": "Приватное сообщение", "en": "Private message"},
    "PERSONAL_CHAT_MESSAGE": {"ru": "Персональное сообщение в чат", "en": "Personal chat message"},
    "REPLY": {"ru": "Ответ", "en": "Reply"},
    "CANCEL": {"ru": "Отмена", "en": "Cancel"},
    "DELETE_MESSAGE": {"ru": "Удалить сообщение", "en": "Delete message"},
    "DELETE_ALL_MESSAGES": {"ru": "Удалить все сообщения", "en": "Delete all messages"},
    "CHAT_CALLSIGN_REQUIRED": {"ru": "Введите свой Chat callsign на вкладке Talks чтобы отправлять сообщения.",
        "en": "Insert your Chat callsign on the Talks tab to post messages." },
    "COMMENTS": {"ru": "Комментарии", "en": "Comments" },
    "COMMENT": {"ru": "комментарий", "en": "сomment" },
    "STATION_CALLSIGN_CHANGE_WARNING": {
        "ru": "При смене позывного станции будут очищены логи и маршрут экспедиции. Продолжить?",
        "en": "You have changed the station callsign. Log records and expedition track will be cleared. Do you really want to proceed?"
    },
    "INVALID_STATION_CALLSIGN": {
        "en": "The expedition callsign should be valid and the only one.",
        "ru": "Необходимо ввести ровно один корректный позывной экспедиции."
    },
    "STATION_INFO_SIZE_LIMIT": {
        "en": "The size limit for all your station information is 5 Megabytes. Please reduce the quantity and size of your images.",
        "ru": "Максимальный допустимый размер всех ваших данных - 1 мегабайт. Пожалуйста, уменьшите количество и объем изображений"
    }
}
